/*
ÔÚscanf()ÖÐ£¬ÓÃ%*#£¬¾Í´ú±í¶ÁÈëÒ»¸ö#µÄÊý¾Ý£¬µ«²»´¦Àí¡£±ÈÈç:
scanf("%c%*c%c", &a, &b, &c);
ÊäÈëABC£¬´ËÊ±£¬±äÁ¿a='A', c='C'¡£¶øÖÐ¼äµÄ'B'£¬Ö»ÊÇ¶ÁÈë£¬Ã»ÓÐ×öÈÎºÎ´¦Àí¡£

ÔÚprintf()ÖÐ£¬%*#ÓÃÀ´Éè¶¨³¡¿í¡£
ÎÒÃÇÆ½Ê±ÓÃ%2dÒ»ÀàµÄ×ªÒå×Ö·ûÀ´´ú±íÊä³öÕûÐÎdÊ±³¡¿íÎª2¸ö×Ö·û£¬µ«ÕâÖÖ·½·¨ÉèÖÃ³¡¿í
Ö»ÄÜÊÇ³£Êý£¬²»ÄÜÔÚ³ÌÐòÔËÐÐÊ±Æä±ä»¯¡£
¶øÓÃ'*'£¬¾Í×öµ½ÁË¿É±ä³¡¿íµÄ×÷ÓÃ¡£±ÈÈç:
printf("%*d", 4, a);
±íÊ¾Êä³öÕûÐÎÊý¾Ýa£¬³¡¿íÎª4¸ö×Ö·û¡£
*/
#include <stdio.h>

int main() {
    char c;
    int i = 0, n;
    
    while ((c = getchar()) != '@') {
        scanf("%d%*c", &n);
        printf(i ? "\n%*c\n" : "%*c\n", n, c);//×÷ÓÃÔÚÁ½¸öÑù°åÈý½ÇÐÎÖ®¼ä¼ÓÉÏÒ»¿ÕÐÐ 
        if (n == 1) {
            i = 1;
            continue;
        }
        for (i = 1; i + 1 < n; i++)
            printf("%*c%*c\n", n -i, c, i*2, c);
        for (i = 0; i < 2*n - 1; i++)
            putchar(c);
        putchar('\n');
    }
    return 0;
}
